[
  {
    "id": 1,
    "name": "Classic Vanilla",
    "image": "https://i.ibb.co.com/B5g4wNgt/Figure.png",
    "rating": 4.5,
    "price": 3.99,
    "description": "Vanilla ice cream is one of the most popular flavors in the world because of its simple yet timeless taste. It has a creamy texture, a smooth flavor, and a light sweetness that makes it versatile for pairing with almost any dessert. Many people enjoy it on its own, but it can also be topped with chocolate syrup, caramel, nuts, or fruits to create a more indulgent treat. The origin of vanilla flavor comes from vanilla beans, which are derived from orchids, primarily found in Madagascar and Mexico. The natural vanilla flavor is rich and aromatic, giving ice cream a delightful fragrance. Over the years, vanilla has become the go-to base flavor in milkshakes, sundaes, and cakes. It is often seen as the ‘default’ flavor but has its own unique charm. Vanilla ice cream is also widely used in baking recipes as an accompaniment to pies, brownies, and puddings. The creamy consistency and light taste make it a favorite for people of all ages. Many brands produce vanilla ice cream, but the ones made with natural vanilla beans are considered premium. Apart from taste, vanilla ice cream holds cultural significance as well, being a flavor that has stood the test of time. In hot summers, a scoop of vanilla ice cream is refreshing, while in winters, it pairs beautifully with hot desserts. It is often recommended for people who prefer lighter flavors compared to richer chocolate or nut-based options. Vanilla’s simplicity is what makes it elegant, and its universal appeal ensures it never goes out of fashion. Whether eaten from a cone, a cup, or blended into a milkshake, vanilla ice cream continues to be a classic choice loved by millions.",
    "reviews": [
      {
        "user": "Arif",
        "comment": "Smooth and creamy, perfect for summer!",
        "rating": 5
      },
      {
        "user": "Maya",
        "comment": "A little too sweet for me, but overall nice.",
        "rating": 4
      }
    ],
    "additionalInformation": {
      "flavorType": "Classic",
      "nutrition": { "calories": 207, "sugar": "21g", "fat": "11g" },
      "availability": "Available all year"
    }
  },
  {
    "id": 2,
    "name": "Chocolate Fudge",
    "image": "https://i.ibb.co.com/TqYzgbjh/7.png",
    "rating": 4.8,
    "price": 4.49,
    "description": "Chocolate fudge ice cream is a rich, indulgent dessert crafted for chocolate lovers worldwide. Its creamy texture combined with intense chocolate flavor makes it one of the most sought-after ice creams. The base is made from premium cocoa, giving it a deep and slightly bitter note, perfectly balanced by sweetness. To enhance the flavor, chunks of fudge or swirls of chocolate sauce are often mixed in, making every bite a delightful experience. Chocolate has a universal appeal, and this flavor is a top choice in sundaes, milkshakes, and ice cream cakes. Its versatility means it can be eaten on its own or paired with toppings like whipped cream, berries, or nuts. Chocolate fudge ice cream is also a comfort food for many, associated with happy childhood memories or cozy evenings. Its rich taste satisfies sweet cravings instantly, making it a go-to option when someone wants a luxurious treat. High-quality chocolate ice creams are often crafted with Belgian chocolate or dark chocolate for a premium feel. Nutritionally, chocolate ice cream is higher in calories compared to vanilla, but it provides a more satisfying richness. The combination of smooth cream and chocolate chunks keeps the texture exciting and enjoyable. Many ice cream parlors feature chocolate fudge as their bestseller, and it remains one of the most requested flavors. It is an ideal choice for parties, romantic dinners, or just a relaxing day at home. For chocoholics, chocolate fudge ice cream is more than just a dessert—it is an emotion. Its irresistible flavor continues to dominate ice cream shops and grocery stores across the globe. This is why chocolate fudge is not just another ice cream flavor but a timeless indulgence that never fails to impress.",
    "reviews": [
      {
        "user": "Rahim",
        "comment": "Best chocolate ice cream I’ve ever had!",
        "rating": 5
      },
      {
        "user": "Nusrat",
        "comment": "Too rich for daily eating, but delicious.",
        "rating": 4
      }
    ],
    "additionalInformation": {
      "flavorType": "Premium",
      "nutrition": { "calories": 230, "sugar": "25g", "fat": "12g" },
      "availability": "Best seller in summer"
    }
  },
  {
    "id": 3,
    "name": "Strawberry Delight",
    "image": "https://i.ibb.co.com/Q2zSM40/8.png",
    "rating": 4.6,
    "price": 4.29,
    "description": "Strawberry ice cream is a fruity, refreshing option for those who enjoy a lighter dessert compared to chocolate or caramel-based varieties. Made with fresh strawberries or strawberry puree, this ice cream offers a natural sweetness combined with a subtle tartness. The pink hue makes it visually appealing, often associated with romance and summer picnics. Strawberry ice cream has been around for centuries and is considered one of the original three ice cream flavors along with vanilla and chocolate. Its flavor is delicate yet distinctive, pleasing both children and adults. Some variations come with real strawberry chunks, adding texture and freshness. Strawberry ice cream also pairs well with whipped cream, waffles, or pancakes, making it a versatile dessert. Unlike heavier ice creams, strawberry provides a refreshing aftertaste that feels light on the palate. Its fruity profile also makes it popular among health-conscious dessert lovers, especially when made with real fruit and low-fat cream. Many artisan brands create premium versions using organic strawberries for richer flavor. Strawberry ice cream is also widely used in milkshakes, parfaits, and sundaes. For people who love fruit-based desserts, it is an absolute favorite. Beyond taste, strawberry ice cream is symbolic of freshness, love, and happiness. Eating a scoop on a sunny day feels refreshing, while combining it with chocolate or vanilla can create a classic Neapolitan experience. Overall, strawberry ice cream stands out as a flavor that balances sweetness, fruitiness, and creaminess in the perfect way. It is a timeless dessert that continues to be enjoyed worldwide and remains a symbol of summer joy.",
    "reviews": [
      {
        "user": "Tania",
        "comment": "Refreshing and light, I love the fruity flavor!",
        "rating": 5
      },
      {
        "user": "Hasan",
        "comment": "Not as creamy as chocolate, but still good.",
        "rating": 4
      }
    ],
    "additionalInformation": {
      "flavorType": "Fruity",
      "nutrition": { "calories": 190, "sugar": "20g", "fat": "9g" },
      "availability": "Popular in summer"
    }
  },
  {
    "id": 4,
    "name": "Mango Tango",
    "image": "https://i.ibb.co.com/GfcxKxMV/9.png",
    "rating": 3,
    "price": 4.59,
    "description": "Mango ice cream is a tropical delight that captures the sweetness and richness of ripe mangoes in every scoop. Its bright orange-yellow color is visually inviting and brings a taste of summer to anyone enjoying it. Mango is often called the 'king of fruits,' and when turned into ice cream, it creates a dessert that is sweet, creamy, and slightly tangy. Mango ice cream is especially popular in Asian countries, where mangoes are a seasonal favorite. Premium versions use real Alphonso or Himsagar mangoes, which provide a more intense flavor and fragrance. Unlike artificial fruit ice creams, mango ice cream made with real fruit pulp tastes natural and refreshing. It is often enjoyed as a standalone treat or served with fruit salads and puddings. Mango ice cream pairs exceptionally well with coconut or vanilla flavors, enhancing its tropical profile. Many street vendors in South Asia serve mango ice cream as part of summer festivals, making it not just a dessert but also a cultural experience. Nutritionally, mango ice cream provides vitamin C and antioxidants, though like all ice creams, it contains sugar and fat. It is widely loved by children because of its sweet fruity flavor and by adults for its refreshing nature. Mango ice cream is also a trending choice in milkshakes and ice cream cakes, adding a tropical twist to traditional recipes. The joy of biting into small frozen mango chunks within the creamy base makes the texture delightful. For those who love tropical fruits, mango ice cream is a must-try flavor. It brings sunshine and joy into every scoop, making summers more memorable and winters more cheerful.",
    "reviews": [
      {
        "user": "Samiha",
        "comment": "Tastes like real mangoes, absolutely loved it!",
        "rating": 5
      },
      {
        "user": "Kabir",
        "comment": "Refreshing but a little too sweet for me.",
        "rating": 4
      }
    ],
    "additionalInformation": {
      "flavorType": "Tropical",
      "nutrition": { "calories": 200, "sugar": "22g", "fat": "10g" },
      "availability": "Seasonal favorite"
    }
  },
  {
    "id": 5,
    "name": "Pistachio Paradise",
    "image": "https://i.ibb.co.com/j9FzwPFP/1.png",
    "rating": 4,
    "price": 4.99,
    "description": "Pistachio ice cream is a nutty, luxurious dessert that combines the smoothness of cream with the distinct earthy flavor of pistachios. Its pale green color makes it instantly recognizable and appealing. Pistachio ice cream is often considered a sophisticated flavor, enjoyed by those who prefer less sweetness and more depth in their desserts. The natural pistachio paste used in premium ice creams gives a subtle sweetness, balanced by a mild nutty bitterness. Unlike mainstream flavors like chocolate and vanilla, pistachio offers a unique taste that sets it apart. It is commonly topped with roasted pistachio pieces to add crunch and enhance flavor. Pistachio ice cream pairs well with coffee, caramel, or chocolate-based desserts. In Mediterranean and Middle Eastern cultures, pistachio is a common ingredient in sweets, making pistachio ice cream a culturally significant dessert. Its flavor is rich yet light, making it suitable for both casual enjoyment and special occasions. Nutritionally, pistachios are packed with protein and healthy fats, giving this ice cream a slightly healthier profile compared to other flavors. Many ice cream artisans highlight pistachio as part of their premium collections, appealing to those with a refined palate. Pistachio ice cream is also a frequent guest at weddings and celebrations because of its elegant flavor profile. Though not as popular as chocolate or vanilla, those who love pistachio often remain loyal fans. The creamy nutty taste is unforgettable and keeps people coming back. Whether served in a cup, cone, or paired with pastries, pistachio ice cream brings sophistication to the dessert table and offers a memorable indulgence.",
    "reviews": [
      {
        "user": "Imran",
        "comment": "Nutty and creamy, feels very premium!",
        "rating": 5
      },
      {
        "user": "Farzana",
        "comment": "I like it, but not my everyday choice.",
        "rating": 4
      }
    ],
    "additionalInformation": {
      "flavorType": "Nutty",
      "nutrition": { "calories": 215, "sugar": "19g", "fat": "13g" },
      "availability": "Specialty flavor"
    }
  },
  {
    "id": 6,
    "name": "Cookies & Cream",
    "image": "https://i.ibb.co.com/Zz9Fgns6/2.png",
    "rating": 5,
    "price": 4.89,
    "description": "Cookies & Cream ice cream is one of the most beloved modern flavors, especially among young people. It combines smooth vanilla or sweet cream ice cream with crunchy chocolate cookie pieces, usually resembling Oreo cookies. The balance of creamy and crunchy textures makes every spoonful exciting. Cookies & Cream is often described as the perfect blend of two desserts in one: ice cream and cookies. The flavor has gained huge popularity worldwide since its invention in the late 20th century and continues to dominate as a top choice in ice cream shops. The dark cookie pieces against the white cream base create a visually attractive contrast. Its taste is sweet, chocolatey, and creamy all at once. Many fast-food chains have adopted Cookies & Cream for milkshakes, sundaes, and desserts, making it a globally recognized flavor. It is especially loved by children, though adults find it equally enjoyable. The cookie chunks provide texture, making it more filling compared to plain ice cream flavors. Many variations exist, with some using double the cookie chunks for extra crunch. Cookies & Cream has also become a staple in ice cream cakes and frozen desserts. Nutritionally, it is indulgent but satisfying, with the cookies adding extra carbohydrates and sugar. For people looking for a fun, indulgent treat, this flavor is unmatched. It is not just ice cream—it is a nostalgic experience that reminds people of their favorite childhood cookies. Its popularity ensures it will remain a classic for generations to come, a true icon among ice cream flavors.",
    "reviews": [
      {
        "user": "Rafi",
        "comment": "The best flavor ever, love the cookie chunks!",
        "rating": 5
      },
      {
        "user": "Nadia",
        "comment": "A little heavy, but super tasty.",
        "rating": 4
      }
    ],
    "additionalInformation": {
      "flavorType": "Fun",
      "nutrition": { "calories": 240, "sugar": "26g", "fat": "12g" },
      "availability": "Always available"
    }
  },
  {
    "id": 7,
    "name": "Caramel Swirl",
    "image": "https://i.ibb.co.com/ksNWBTtB/3.png",
    "rating": 4,
    "price": 4.79,
    "description": "Caramel Swirl ice cream is a sweet and buttery delight that combines smooth ice cream with ribbons of golden caramel sauce. Its rich flavor makes it one of the most indulgent options for dessert lovers. The base is usually vanilla or sweet cream ice cream, which acts as a neutral background for the caramel’s strong, buttery sweetness. Every bite is filled with a delightful contrast between creamy and gooey textures. Caramel has been used in desserts for centuries, and when swirled into ice cream, it creates an irresistible treat. Some versions add a hint of sea salt, giving it a salted caramel twist that balances the sweetness. Caramel Swirl is a favorite in sundaes and is often topped with whipped cream and nuts. The flavor is especially popular among those who prefer rich and buttery desserts. Unlike fruit-based ice creams, caramel swirl leans heavily toward sweetness, making it a true indulgence. Nutritionally, it is higher in sugar but also more satisfying, making it a great occasional treat. Caramel swirl ice cream is perfect for those cozy evenings when you want comfort food in frozen form. It pairs beautifully with brownies, apple pie, or even pancakes. The smooth caramel ribbons create a luxurious mouthfeel that lingers on the tongue. Whether eaten alone or with toppings, caramel swirl remains a favorite for people who crave sweetness with depth. Its popularity has grown in both premium ice cream shops and supermarkets, ensuring it remains a readily available classic flavor.",
    "reviews": [
      {
        "user": "Shuvo",
        "comment": "So creamy and buttery, I can’t stop eating it!",
        "rating": 5
      },
      {
        "user": "Lamia",
        "comment": "Too sweet for my taste, but still nice.",
        "rating": 3
      }
    ],
    "additionalInformation": {
      "flavorType": "Sweet",
      "nutrition": { "calories": 250, "sugar": "28g", "fat": "13g" },
      "availability": "Popular in winter"
    }
  },
  {
    "id": 8,
    "name": "Mint Chocolate",
    "image": "https://i.ibb.co.com/WNGLNKJd/4.png",
    "rating": 4,
    "price": 4.39,
    "description": "Mint Chocolate Chip ice cream is a refreshing yet indulgent flavor that combines cool minty cream with crunchy chocolate chips. Its green color makes it instantly recognizable, and the sharp, fresh mint taste balances beautifully with the sweetness of chocolate. This flavor is particularly popular among those who prefer desserts that are not overwhelmingly sweet. The mint provides a cooling sensation, making it especially enjoyable during hot summers. Chocolate chips add a crunchy texture and a rich cocoa flavor, keeping the experience exciting with every spoonful. Mint chocolate chip has become one of the iconic flavors available in almost every ice cream parlor worldwide. Some premium versions use dark chocolate shavings and natural peppermint extract, enhancing the flavor’s sophistication. Mint ice cream is also linked with feelings of freshness and energy, making it a fun and lively choice. Nutritionally, it is moderate in calories compared to caramel or chocolate-based flavors. Mint chocolate chip is also widely used in milkshakes, ice cream cakes, and sundaes. Its unique balance of refreshing and indulgent qualities makes it a versatile flavor for various occasions. Some people are divided about mint in desserts, but those who love it remain loyal fans. The contrast of cool mint with sweet chocolate creates a memorable combination. Over the years, mint chocolate chip has become a symbol of playful indulgence, reminding people of childhood summers and carefree days. It continues to hold its place as one of the top classic ice cream flavors enjoyed across the globe.",
    "reviews": [
      {
        "user": "Amin",
        "comment": "Refreshing and light, I love the minty flavor!",
        "rating": 5
      },
      {
        "user": "Joya",
        "comment": "Not my favorite, but unique taste.",
        "rating": 3
      }
    ],
    "additionalInformation": {
      "flavorType": "Refreshing",
      "nutrition": { "calories": 195, "sugar": "19g", "fat": "10g" },
      "availability": "Best in summer"
    }
  },
  {
    "id": 9,
    "name": "Blueberry Bliss",
    "image": "https://i.ibb.co.com/LXW0LBqK/6.png",
    "rating": 5,
    "price": 4.69,
    "description": "Blueberry ice cream is a fruity, antioxidant-rich dessert that combines the natural sweetness and tanginess of blueberries with smooth, creamy ice cream. Its purple-blue hue makes it visually striking and immediately appealing to anyone looking for a unique treat. Unlike more common flavors such as chocolate or vanilla, blueberry ice cream offers a balance of tartness and sweetness that refreshes the palate. Premium versions are made with real blueberry puree or whole blueberries, which burst with flavor when bitten into. The creamy base complements the berries, creating a perfect balance between richness and fruitiness. Blueberry ice cream is especially popular during summer when berries are in season, but frozen blueberries make it available year-round. The flavor is often described as refreshing, sophisticated, and slightly exotic compared to mainstream fruit flavors. Blueberry ice cream pairs well with lemon, vanilla, or even cheesecake, making it a versatile dessert choice. Some variations include swirls of blueberry sauce or chunks of fruit for added texture. Beyond taste, blueberries are known for being rich in vitamins and antioxidants, giving this flavor a ‘healthier’ reputation compared to purely indulgent varieties. While it still contains sugar and cream, the presence of real fruit makes many feel less guilty about enjoying it. Blueberry ice cream is also a popular ingredient in sundaes, parfaits, and frozen yogurt blends. Its refreshing taste makes it an ideal summer treat, though many enjoy it all year long. For those seeking something different from traditional flavors, blueberry ice cream offers a delightful and memorable experience. Whether served in a cone, cup, or alongside baked goods, Blueberry Bliss stands out as a fruity favorite that combines indulgence with freshness. Its uniqueness and beautiful color make it not just a dessert but a joyful celebration of berries in frozen form.",
    "reviews": [
      {
        "user": "Elina",
        "comment": "Fruity, fresh, and deliciously creamy!",
        "rating": 5
      },
      {
        "user": "Kamal",
        "comment": "A bit tangy for me, but still enjoyable.",
        "rating": 4
      }
    ],
    "additionalInformation": {
      "flavorType": "Fruity",
      "nutrition": { "calories": 185, "sugar": "18g", "fat": "9g" },
      "availability": "Best during blueberry season"
    }
  }
]
